// Lab_03_2.cpp
// <Менчинського Артема>
// Лабораторна робота № 3.2
// Розгалуження, задане формулою: функція з параметрами.
// Варіант 22
#include <iostream>
#include <cmath>
using namespace std;

int main()
{
    double x;  // вхідний аргумент
    double a;  // вхідний параметр
    double b;  // вхідний параметр
    double c;  // вхідний параметр
    double F1, F2;  // результати обчислення за двома способами

    // Введення даних
    cout << "a = "; cin >> a;
    cout << "b = "; cin >> b;
    cout << "c = "; cin >> c;
    cout << "x = "; cin >> x;

    // *** Спосіб 1: Розгалуження в скороченій формі ***
    if (x + 5 < 0 && c == 0)
    {
        F1 = 1 / (a * x) - b;
    }
    else if (x + 5 > 0 && c != 0)
    {
        F1 = (x - a) / x;
    }
    else
    {
        F1 = 10 * x / (c - 4);
    }

    // Виведення результату за першим способом
    cout << "1) F = " << F1 << " way-1" << endl;

    // *** Спосіб 2: Розгалуження в повній формі ***
    if (x + 5 < 0 && c == 0)
    {
        F2 = 1 / (a * x) - b;
    }
    else
    {
        if (x + 5 > 0 && c != 0)
        {
            F2 = (x - a) / x;
        }
        else
        {
            F2 = 10 * x / (c - 4);
        }
    }

    // Виведення результату за другим способом
    cout << "2) F = " << F2 << " way-2 " << endl;

    return 0;
}
